reddit_clone/reddit/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.save!
---
INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "testuser"], ["password_digest", "test"], ["session_token", "2pwUiamOofUlao4FB65P7Q"]]